app/views/checkpoints/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."checkpoint_id" = ?  [["checkpoint_id", 1]]
---
<div class="container mt-4">
  <% if @checkpoint.tasks.present? %>
    <div class="row">
      <% @checkpoint.tasks.each do |task| %>