app/views/projects/_form.html.erb

SELECT "fields".* FROM "fields"
SELECT "fields".* FROM "fields" INNER JOIN "fields_projects" ON "fields"."id" = "fields_projects"."field_id" WHERE "fields_projects"."project_id" = ?  [["project_id", 1]]
---
        <label class="form-label">Select Fields:</label>
        <% Field.all.each do |field| %>
          <label class="checkbox-label">
            <input type="checkbox" name="field_ids[]" value="<%= field.id %>" <%= 'checked' if project.fields.exists?(field.id) %>>