app/views/projects/_projects.html.erb

SELECT COUNT(*) FROM "user_projects" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]
SELECT "fields".* FROM "fields" INNER JOIN "fields_projects" ON "fields"."id" = "fields_projects"."field_id" WHERE "fields_projects"."project_id" = ?  [["project_id", 1]]
---
          <td>Numero membri:
            <%= UserProject.where(:project_id => project.id).count %></td>
          <td>Ambito:
            <% project.fields.each do |field| %>