app/views/projects/_projects.html.erb

<div id="projects">
  <% current_user_fields = current_user.fields.pluck(:nome) %>
  <% @projects_with_common_fields = @projects.select { |project| (project.fields.pluck(:nome) & current_user_fields).any? } %>
---
SELECT "fields"."nome" FROM "fields" INNER JOIN "fields_users" ON "fields"."id" = "fields_users"."field_id" WHERE "fields_users"."user_id" = ?  [["user_id", 1]]
SELECT "fields"."nome" FROM "fields" INNER JOIN "fields_projects" ON "fields"."id" = "fields_projects"."field_id" WHERE "fields_projects"."project_id" = ?  [["project_id", 1]]

          <td>Numero membri:
            <%= UserProject.where(:project_id => project.id).count %></td>
          <td>Ambito:
            <% project.fields.each do |field| %>
---
SELECT "user_projects"."project_id" FROM "user_projects" WHERE "user_projects"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "user_projects" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]
SELECT "fields".* FROM "fields" INNER JOIN "fields_projects" ON "fields"."id" = "fields_projects"."field_id" WHERE "fields_projects"."project_id" = ?  [["project_id", 1]]

          <td> Leader:
            <% project.user_projects.each do |user_project| %>
---
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]