app/views/projects/_projects.html.erb

SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC
---
              <td>Leader:
                <% project.user_projects.each do |user_project| %>