app/views/projects/index.html.erb

SELECT COUNT(*) FROM "user_projects" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]
---
        <td><%= project.descrizione %></td>
        <td>Numero membri: <%= UserProject.where(:project_id => project.id).count %></td>