app/views/projects/index.html.erb

  <%= form.label "Filtra per ambito" %>
  <%= form.select :field, options_for_select(Field.all.map { |fie| [fie.nome, fie.id] }.insert(0, nil)) %>
---
SELECT "fields".* FROM "fields"