app/views/projects/my_projects.html.erb

SELECT "projects".* FROM "projects" INNER JOIN "user_projects" ON "projects"."id" = "user_projects"."project_id" WHERE "user_projects"."user_id" = ?  [["user_id", 5]]
---
    <tbody>
    <% if current_user.projects.present? %>
      <% current_user.projects.each do |project| %>