app/views/projects/show_my_project.html.erb

<h1><%= @project.name %></h1>
<% if @project.checkpoints.present? %>
---
SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."project_id" = ?  [["project_id", 1]]

        <div class="message">
          <%= User.find(message.user_id).username %>: <%= message.content %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]