app/views/projects/show.html.erb

    <p class="project-description">
      <% @project.fields.each do |field|%>
---
SELECT "fields".* FROM "fields" INNER JOIN "fields_projects" ON "fields"."id" = "fields_projects"."field_id" WHERE "fields_projects"."project_id" = ?  [["project_id", 1]]

    <h3>Persone richieste per il progetto</h3>
    <p class="project-description"><%= @project.dimensione - @members.count %></p>
---
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."project_id" = ?  [["project_id", 10]]