app/views/projects/show.html.erb

      <div class="button-container">
        <% if not UserProject.where(user_id: current_user.id, project_id: @project.id).first %>
---
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 10], ["LIMIT", 1]]