app/views/projects/show_my_project.html.erb

SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."project_id" = ?  [["project_id", 1]]
---
<% if @project.checkpoints.present? %>
  <% @project.checkpoints.each do |checkpoint| %>