app/controllers/checkpoints_controller.rb

SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @checkpoint = Checkpoint.find(params[:id])