app/controllers/checkpoints_controller.rb

SELECT "checkpoints".* FROM "checkpoints"
---
  def index
    @checkpoints = Checkpoint.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new
    @checkpoint = Checkpoint.new
    @project = Project.find(params[:project_id])

SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @checkpoint = Checkpoint.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "checkpoints" ("nome", "descrizione", "completato", "created_at", "updated_at", "project_id") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Checkpoint 1"], ["descrizione", "provaaa"], ["completato", 0], ["created_at", "2023-08-17 12:26:48.112224"], ["updated_at", "2023-08-17 12:26:48.112224"], ["project_id", 3]]
---
  def create
    @checkpoint = Checkpoint.new(checkpoint_params)
    @project = Project.find(params[:project_id])
    @project.checkpoints << @checkpoint

UPDATE "checkpoints" SET "descrizione" = ?, "updated_at" = ? WHERE "checkpoints"."id" = ?  [["descrizione", "secondo"], ["updated_at", "2023-08-16 12:33:29.066764"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @checkpoint.update(checkpoint_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."checkpoint_id" = ?  [["checkpoint_id", 2]]
UPDATE "checkpoints" SET "completato" = ?, "updated_at" = ? WHERE "checkpoints"."id" = ?  [["completato", 1], ["updated_at", "2023-08-16 12:52:46.245994"], ["id", 3]]
---
  def change_state
    completati = true
    @checkpoint.tasks.each do |task|
      if task.completato == false
        completati = false
      end
    end
    if completati
      @checkpoint.completato = true
      @checkpoint.save

SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."checkpoint_id" = ?  [["checkpoint_id", 1]]
SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 1], ["LIMIT", 1]]
---
    def set_variables
      @user = current_user
      parameter = params[:id] || params[:checkpoint_id]
      @checkpoint = Checkpoint.find(parameter)
      @tasks = @checkpoint.tasks
      @project = Project.find(@checkpoint.project_id)
      @role = UserProject.where(user_id: current_user.id, project_id: @project.id).first.role

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 1], ["LIMIT", 1]]
---
    def is_member?
      @user_project = UserProject.where(user_id: current_user.id, project_id: params[:project_id]).first