app/controllers/checkpoints_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def project_started?
      @project = Project.find(params[:project_id])