app/controllers/latest_news_controller.rb

  def index
    newsapi = News.new("4ee60b1af31f4bd1b9b41fd4c4399b2f")

    @user = current_user
    topics = ""
    @user.fields.each do |field|
---
SELECT "fields".* FROM "fields" INNER JOIN "fields_users" ON "fields"."id" = "fields_users"."field_id" WHERE "fields_users"."user_id" = ?  [["user_id", 2]]