app/controllers/progettos_controller.rb

SELECT "progettos".* FROM "progettos"
---
  def index
    @progettos = Progetto.all