app/controllers/projects_controller.rb

SELECT "fields"."id" FROM "fields"
SELECT "fields_projects"."id" FROM "fields_projects" WHERE "fields_projects"."field_id" IS NULL
---
  def index
=begin
    @all_fields = Field.all.ids
    if params[:field] == nil
      if session[:field] == nil
        @selected_fields = @all_fields
      else
        @selected_fields = session[:field]
      end
    elsif params[:field] != nil
      @selected_fields = params[:field]
    else
      @selected_fields = @all_fields
    end

    base = Project.where(id: FieldsProject.where(field_id: params[:field]).ids)