app/controllers/projects_controller.rb

  def is_member?
    @user_project = UserProject.where(user_id: @user.id, project_id: @project.id).first
---
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 1], ["LIMIT", 1]]

  def is_leader?
    @user_project = UserProject.where(user_id: @user.id, project_id: @project.id).first
---
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 3], ["LIMIT", 1]]

  def index
=begin
    @all_fields = Field.all.ids
    if params[:field] == nil
      if session[:field] == nil
        @selected_fields = @all_fields
      else
        @selected_fields = session[:field]
      end
    elsif params[:field] != nil
      @selected_fields = params[:field]
    else
      @selected_fields = @all_fields
    end

    base = Project.where(id: FieldsProject.where(field_id: params[:field]).ids)

    base = case params[:sort_by]
             when 'members'
               base.order(dimensione: :desc)
             when 'members_reverse'
               base.order(dimensione: :asc)
             when 'time_posted_reverse'
               base.order(created_at: :asc)
             when 'time_posted'
               base.order(created_at: :desc)
             else
               base.order(created_at: :desc)
           end

    @project = base.all
---
SELECT "fields"."id" FROM "fields"
SELECT "fields_projects"."id" FROM "fields_projects" WHERE "fields_projects"."field_id" IS NULL
SELECT "projects".* FROM "projects" ORDER BY "projects"."dimensione" DESC
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC
SELECT "fields".* FROM "fields" WHERE "fields"."id" IN (?, ?)  [["id", 2], ["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def new
    @project = Project.new
    @fields = Field.all
---
SELECT "fields".* FROM "fields"

  def create
    parameters = project_params.except(:ambiti)
    @project = Project.new(parameters)
    id_ambiti = params[:project][:ambiti].drop(1)
    id_ambiti.each do |ambito|
      @project.fields << Field.find(ambito)
---
INSERT INTO "projects" ("info_leader", "dimensione", "descrizione", "stato", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["info_leader", ""], ["dimensione", nil], ["descrizione", ""], ["stato", ""], ["created_at", "2023-07-29 15:06:04.895600"], ["updated_at", "2023-07-29 15:06:04.895600"]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      parameters = project_params.except(:ambiti)
      id_ambiti = params[:project][:ambiti].drop(1)
      if @project.update(parameters)
        id_ambiti.each do |ambito|
          field = Field.find(ambito)
          if not @project.fields.include? field
            @project.fields << field
          end
        end
        @project.fields.each do |field|
          if not id_ambiti.include? field.id.to_s
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_user
    @user = current_user
    @projects_member = []
    UserProject.where(user_id: @user.id, role: "member").each do |user_project|
      @projects_member << Project.find(user_project.project_id)
---
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 10], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" INNER JOIN "user_projects" ON "projects"."id" = "user_projects"."project_id" WHERE "user_projects"."user_id" = ?  [["user_id", 5]]