app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    parameters = project_params.except(:ambiti)
    @project = Project.new(parameters)
    id_ambiti = params[:project][:ambiti].drop(1)
    id_ambiti.each do |ambito|
      @project.fields << Field.find(ambito)
---
INSERT INTO "user_projects" ("user_id", "project_id", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["project_id", 1], ["created_at", "2023-08-09 10:18:11.347490"], ["updated_at", "2023-08-09 10:18:11.347490"], ["role", "leader"]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]