app/controllers/requests_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? ORDER BY "projects"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 6], ["project_id", 3], ["LIMIT", 1]]
---
  def new
    @project = Project.where(id: params[:project_id]).first
    if UserProject.where(user_id: current_user.id, project_id: @project.id).first

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 6], ["project_id", 7], ["LIMIT", 1]]
INSERT INTO "requests" ("note", "stato_accettazione", "created_at", "updated_at", "user_id", "project_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if UserProject.where(user_id: current_user.id, project_id: @project.id).first
      redirect_to root_path, notice: "Fai già parte di questo progetto"
      return
    end
    if @project.stato != "aperto"
      redirect_to root_path, notice: "Le richieste di questo progetto sono chiuse"
      return
    end
    @request = Request.new(request_params)
    @project_id = params[:project_id]
    @request.project_id = @project_id
    @request.user_id = current_user.id
    @request.stato_accettazione = "In attesa"

    respond_to do |format|
      if @request.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_request
    @project = Project.find(params[:project_id])
    parameter = params[:id] || params[:request_id]
    @request = Request.find(parameter)