app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def new
    @task = Task.new
    @checkpoint = Checkpoint.find(params[:checkpoint_id])
    @project = Project.find(@checkpoint.project_id)
---
SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)
    @checkpoint = Checkpoint.find(params[:checkpoint_id])
    @checkpoint.tasks << @task
---
SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "tasks" ("nome", "descrizione", "completato", "created_at", "updated_at", "checkpoint_id") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "prova"], ["descrizione", "desc prova"], ["completato", 0], ["created_at", "2023-08-17 12:27:38.801907"], ["updated_at", "2023-08-17 12:27:38.801907"], ["checkpoint_id", 7]]

  def change_state
    if @task.completato == true
      redirect_to project_checkpoint_path(project_id: @project.id, id: @checkpoint.id), notice: "Task già completato"
    end
    @task.completato = true
    @task.save
---
UPDATE "tasks" SET "completato" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completato", 1], ["updated_at", "2023-08-17 12:27:48.008589"], ["id", 9]]

    def set_variables
      parameter = params[:id] || params[:task_id]
      @task = Task.find(parameter)
      @checkpoint = Checkpoint.find(@task.checkpoint_id)
      @project = Project.find(@checkpoint.project_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "checkpoints".* FROM "checkpoints" WHERE "checkpoints"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def is_member?
      @user_project = UserProject.where(user_id: current_user.id, project_id: params[:project_id]).first
---
SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."user_id" = ? AND "user_projects"."project_id" = ? ORDER BY "user_projects"."id" ASC LIMIT ?  [["user_id", 3], ["project_id", 3], ["LIMIT", 1]]

    def project_started?
      @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]