app/controllers/users/registrations_controller.rb

SELECT "fields".* FROM "fields" WHERE "fields"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "fields".* FROM "fields" INNER JOIN "fields_users" ON "fields"."id" = "fields_users"."field_id" WHERE "fields_users"."user_id" = ? AND "fields"."id" NOT IN (?, ?)  [["user_id", 3], ["id", 1], ["id", 2]]
SELECT 1 AS one FROM "fields" INNER JOIN "fields_users" ON "fields"."id" = "fields_users"."field_id" WHERE "fields_users"."user_id" = ? AND "fields"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "sammy2@example.com"], ["updated_at", "2023-08-16 10:12:50.339832"], ["id", 2]]
---
  def update
    @user = current_user
    selected_field_ids = params[:field_ids] || []
    current_field_ids = @user.field_ids

    fields_to_add = Field.where(id: selected_field_ids - current_field_ids)
    fields_to_remove = @user.fields.where.not(id: selected_field_ids)

    fields_to_add.each do |field|
      @user.fields << field unless @user.fields.include?(field)
    end
    @user.fields.delete(fields_to_remove)

    if current_user.provider
      new_username = params[:username]
      if @user.update(username: new_username)