app/views/users/registrations/edit.html.erb

        <label class="form-label">Select Fields:</label>
        <% Field.all.each do |field| %>
          <label class="checkbox-label">
            <input type="checkbox" name="field_ids[]" value="<%= field.id %>" <%= 'checked' if resource.fields.exists?(field.id) %>>
---
SELECT "fields".* FROM "fields"