app/views/users/registrations/edit_oauth.html.erb

SELECT "fields".* FROM "fields"
SELECT 1 AS one FROM "fields" INNER JOIN "fields_users" ON "fields"."id" = "fields_users"."field_id" WHERE "fields_users"."user_id" = ? AND "fields"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
      <label class="form-label">Select Fields:</label>
      <% Field.all.each do |field| %>
        <label class="checkbox-label">
          <input type="checkbox" name="field_ids[]" value="<%= field.id %>" <%= 'checked' if resource.fields.exists?(field.id) %>>